experiment-data/MicroK8s/dp_redis_density/dp_redis_density/memtier-1.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1337.32          ---          ---        13.58943        10.43100        78.33500       148.47900       103.02 
Gets        13371.69         2.33     13369.35        13.57228        10.43100        78.33500       149.50300       520.94 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      14709.01         2.33     13369.35        13.57384        10.43100        78.33500       149.50300       623.96 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.135        0.000
SET       2.991        5.000
SET       4.639       10.000
SET       5.759       15.000
SET       6.719       20.000
SET       7.359       25.000
SET       7.967       30.000
SET       8.639       35.000
SET       9.343       40.000
SET       9.855       45.000
SET      10.431       50.000
SET      10.815       52.500
SET      11.135       55.000
SET      11.519       57.500
SET      11.903       60.000
SET      12.287       62.500
SET      12.735       65.000
SET      13.247       67.500
SET      13.759       70.000
SET      14.399       72.500
SET      14.975       75.000
SET      15.359       76.250
SET      15.743       77.500
SET      16.191       78.750
SET      16.767       80.000
SET      17.279       81.250
SET      17.791       82.500
SET      18.559       83.750
SET      19.199       85.000
SET      19.967       86.250
SET      20.863       87.500
SET      21.375       88.125
SET      22.015       88.750
SET      22.527       89.375
SET      23.167       90.000
SET      23.935       90.625
SET      24.703       91.250
SET      25.599       91.875
SET      26.495       92.500
SET      27.647       93.125
SET      29.055       93.750
SET      29.823       94.062
SET      30.591       94.375
SET      31.615       94.688
SET      32.639       95.000
SET      33.791       95.312
SET      35.071       95.625
SET      36.607       95.938
SET      38.143       96.250
SET      40.191       96.562
SET      42.495       96.875
SET      43.775       97.031
SET      45.055       97.188
SET      46.335       97.344
SET      47.871       97.500
SET      49.663       97.656
SET      51.967       97.812
SET      54.015       97.969
SET      56.575       98.125
SET      59.391       98.281
SET      62.463       98.438
SET      64.511       98.516
SET      66.559       98.594
SET      68.607       98.672
SET      70.655       98.750
SET      73.215       98.828
SET      75.263       98.906
SET      77.823       98.984
SET      80.895       99.062
SET      83.455       99.141
SET      86.527       99.219
SET      88.063       99.258
SET      89.599       99.297
SET      91.647       99.336
SET      93.183       99.375
SET      95.743       99.414
SET      97.791       99.453
SET      99.839       99.492
SET     102.399       99.531
SET     105.471       99.570
SET     108.031       99.609
SET     109.567       99.629
SET     110.591       99.648
SET     112.639       99.668
SET     114.175       99.688
SET     115.711       99.707
SET     117.759       99.727
SET     119.807       99.746
SET     122.367       99.766
SET     124.927       99.785
SET     127.999       99.805
SET     129.535       99.814
SET     131.071       99.824
SET     132.095       99.834
SET     135.167       99.844
SET     137.215       99.854
SET     139.263       99.863
SET     141.311       99.873
SET     143.359       99.883
SET     146.431       99.893
SET     149.503       99.902
SET     151.551       99.907
SET     153.599       99.912
SET     155.647       99.917
SET     156.671       99.922
SET     159.743       99.927
SET     161.791       99.932
SET     163.839       99.937
SET     166.911       99.941
SET     168.959       99.946
SET     174.079       99.951
SET     176.127       99.954
SET     178.175       99.956
SET     180.223       99.958
SET     183.295       99.961
SET     185.343       99.963
SET     188.415       99.966
SET     191.487       99.968
SET     196.607       99.971
SET     199.679       99.973
SET     201.727       99.976
SET     203.775       99.977
SET     207.871       99.978
SET     209.919       99.979
SET     210.943       99.980
SET     211.967       99.982
SET     214.015       99.983
SET     217.087       99.984
SET     222.207       99.985
SET     226.303       99.987
SET     228.351       99.988
SET     229.375       99.988
SET     229.375       99.989
SET     232.447       99.990
SET     236.543       99.990
SET     241.663       99.991
SET     244.735       99.991
SET     246.783       99.992
SET     247.807       99.993
SET     250.879       99.993
SET     251.903       99.994
SET     253.951       99.994
SET     257.023       99.995
SET     262.143       99.995
SET     266.239       99.995
SET     276.479       99.995
SET     278.527       99.996
SET     280.575       99.996
SET     292.863       99.996
SET     294.911       99.997
SET     301.055       99.997
SET     311.295       99.997
SET     311.295       99.997
SET     325.631       99.997
SET     327.679       99.998
SET     331.775       99.998
SET     331.775       99.998
SET     331.775       99.998
SET     335.871       99.998
SET     337.919       99.998
SET     337.919       99.998
SET     344.063       99.999
SET     344.063       99.999
SET     346.111       99.999
SET     348.159       99.999
SET     348.159       99.999
SET     348.159       99.999
SET     350.207       99.999
SET     350.207       99.999
SET     350.207       99.999
[...]
SET     354.303       99.999
SET     354.303       99.999
SET     354.303       99.999
SET     354.303      100.000
SET     354.303      100.000
SET     354.303      100.000
[...]
SET     358.399      100.000
SET     358.399      100.000
SET     358.399      100.000
[...]
SET     368.639      100.000
SET     368.639      100.000
---
GET       0.239        0.000
GET       2.991        5.000
GET       4.639       10.000
GET       5.791       15.000
GET       6.719       20.000
GET       7.359       25.000
GET       7.967       30.000
GET       8.639       35.000
GET       9.343       40.000
GET       9.855       45.000
GET      10.431       50.000
GET      10.815       52.500
GET      11.135       55.000
GET      11.519       57.500
GET      11.903       60.000
GET      12.287       62.500
GET      12.735       65.000
GET      13.247       67.500
GET      13.759       70.000
GET      14.335       72.500
GET      14.975       75.000
GET      15.295       76.250
GET      15.743       77.500
GET      16.191       78.750
GET      16.639       80.000
GET      17.279       81.250
GET      17.791       82.500
GET      18.431       83.750
GET      19.199       85.000
GET      19.967       86.250
GET      20.863       87.500
GET      21.375       88.125
GET      22.015       88.750
GET      22.527       89.375
GET      23.167       90.000
GET      23.935       90.625
GET      24.575       91.250
GET      25.471       91.875
GET      26.495       92.500
GET      27.647       93.125
GET      28.927       93.750
GET      29.695       94.062
GET      30.463       94.375
GET      31.359       94.688
GET      32.383       95.000
GET      33.535       95.312
GET      34.815       95.625
GET      36.351       95.938
GET      37.887       96.250
GET      39.935       96.562
GET      42.239       96.875
GET      43.519       97.031
GET      44.799       97.188
GET      46.079       97.344
GET      47.615       97.500
GET      49.407       97.656
GET      51.455       97.812
GET      53.503       97.969
GET      56.063       98.125
GET      59.135       98.281
GET      62.207       98.438
GET      64.255       98.516
GET      66.047       98.594
GET      68.095       98.672
GET      70.655       98.750
GET      72.703       98.828
GET      75.263       98.906
GET      77.823       98.984
GET      80.383       99.062
GET      82.943       99.141
GET      86.527       99.219
GET      88.063       99.258
GET      89.599       99.297
GET      91.647       99.336
GET      93.183       99.375
GET      95.743       99.414
GET      97.791       99.453
GET     100.351       99.492
GET     102.911       99.531
GET     105.471       99.570
GET     108.031       99.609
GET     109.567       99.629
GET     111.103       99.648
GET     112.639       99.668
GET     114.175       99.688
GET     116.223       99.707
GET     118.271       99.727
GET     120.319       99.746
GET     122.879       99.766
GET     125.439       99.785
GET     127.999       99.805
GET     129.535       99.814
GET     132.095       99.824
GET     133.119       99.834
GET     135.167       99.844
GET     137.215       99.854
GET     140.287       99.863
GET     142.335       99.873
GET     144.383       99.883
GET     147.455       99.893
GET     150.527       99.902
GET     152.575       99.907
GET     154.623       99.912
GET     156.671       99.917
GET     158.719       99.922
GET     160.767       99.927
GET     163.839       99.932
GET     165.887       99.937
GET     168.959       99.941
GET     171.007       99.946
GET     174.079       99.951
GET     176.127       99.954
GET     178.175       99.956
GET     180.223       99.958
GET     182.271       99.961
GET     184.319       99.963
GET     186.367       99.966
GET     189.439       99.968
GET     193.535       99.971
GET     197.631       99.973
GET     200.703       99.976
GET     201.727       99.977
GET     203.775       99.978
GET     205.823       99.979
GET     207.871       99.980
GET     209.919       99.982
GET     211.967       99.983
GET     215.039       99.984
GET     218.111       99.985
GET     222.207       99.987
GET     226.303       99.988
GET     228.351       99.988
GET     229.375       99.989
GET     231.423       99.990
GET     234.495       99.990
GET     238.591       99.991
GET     240.639       99.991
GET     242.687       99.992
GET     244.735       99.993
GET     246.783       99.993
GET     249.855       99.994
GET     250.879       99.994
GET     251.903       99.995
GET     257.023       99.995
GET     260.095       99.995
GET     261.119       99.995
GET     264.191       99.996
GET     268.287       99.996
GET     272.383       99.996
GET     278.527       99.997
GET     282.623       99.997
GET     284.671       99.997
GET     288.767       99.997
GET     290.815       99.997
GET     292.863       99.998
GET     294.911       99.998
GET     301.055       99.998
GET     313.343       99.998
GET     323.583       99.998
GET     325.631       99.998
GET     329.727       99.998
GET     331.775       99.999
GET     333.823       99.999
GET     333.823       99.999
GET     333.823       99.999
GET     335.871       99.999
GET     335.871       99.999
GET     337.919       99.999
GET     337.919       99.999
GET     344.063       99.999
GET     344.063       99.999
GET     346.111       99.999
GET     348.159       99.999
GET     348.159       99.999
GET     348.159       99.999
GET     350.207       99.999
GET     352.255       99.999
GET     354.303      100.000
GET     354.303      100.000
GET     354.303      100.000
[...]
GET     358.399      100.000
GET     358.399      100.000
GET     358.399      100.000
[...]
GET     360.447      100.000
GET     360.447      100.000
GET     364.543      100.000
GET     366.591      100.000
GET     366.591      100.000
GET     366.591      100.000
GET     368.639      100.000
GET     368.639      100.000
GET     368.639      100.000
[...]
GET     370.687      100.000
GET     370.687      100.000
GET     370.687      100.000
[...]
GET     372.735      100.000
GET     372.735      100.000
GET     372.735      100.000
[...]
GET     376.831      100.000
GET     376.831      100.000
---
WAIT      0.000      100.000